<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/930f1fcf-a4cc-4c6e-82e0-752c935440b4/terraform-bin -chdir=terraform show -no-color /tmp/plan.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.ecs.aws_alb.application_load_balancer will be destroyed
  # (because aws_alb.application_load_balancer is not in configuration)
  - resource "aws_alb" "application_load_balancer" {
      - arn                              = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/app/staging-keyserver-lb-104/aba40b31b1bdeda5" -> null
      - arn_suffix                       = "app/staging-keyserver-lb-104/aba40b31b1bdeda5" -> null
      - desync_mitigation_mode           = "defensive" -> null
      - dns_name                         = "staging-keyserver-lb-104-196096211.eu-central-1.elb.amazonaws.com" -> null
      - drop_invalid_header_fields       = true -> null
      - enable_cross_zone_load_balancing = true -> null
      - enable_deletion_protection       = false -> null
      - enable_http2                     = true -> null
      - enable_waf_fail_open             = false -> null
      - id                               = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/app/staging-keyserver-lb-104/aba40b31b1bdeda5" -> null
      - idle_timeout                     = 60 -> null
      - internal                         = false -> null
      - ip_address_type                  = "ipv4" -> null
      - load_balancer_type               = "application" -> null
      - name                             = "staging-keyserver-lb-104" -> null
      - security_groups                  = [
          - "sg-0de033115e9fa8fb0",
        ] -> null
      - subnets                          = [
          - "subnet-056b1e9d7a7c099b3",
          - "subnet-097a520d3b27063c1",
          - "subnet-0a3a5e459c03ba765",
        ] -> null
      - tags                             = {} -> null
      - tags_all                         = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - vpc_id                           = "vpc-09dce0b23af575478" -> null
      - zone_id                          = "Z215JYRZR1TBD5" -> null

      - access_logs {
          - enabled = false -> null
        }

      - subnet_mapping {
          - subnet_id = "subnet-056b1e9d7a7c099b3" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-097a520d3b27063c1" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-0a3a5e459c03ba765" -> null
        }
    }

  # module.ecs.aws_alb.application_load_balancer (deposed object 91104a44) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_alb" "application_load_balancer" {
      - arn                              = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/net/staging-keyserver-lb-893/b703c47f924a3750" -> null
      - arn_suffix                       = "net/staging-keyserver-lb-893/b703c47f924a3750" -> null
      - dns_name                         = "staging-keyserver-lb-893-b703c47f924a3750.elb.eu-central-1.amazonaws.com" -> null
      - enable_cross_zone_load_balancing = false -> null
      - enable_deletion_protection       = false -> null
      - id                               = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/net/staging-keyserver-lb-893/b703c47f924a3750" -> null
      - internal                         = false -> null
      - ip_address_type                  = "ipv4" -> null
      - load_balancer_type               = "network" -> null
      - name                             = "staging-keyserver-lb-893" -> null
      - security_groups                  = [] -> null
      - subnets                          = [
          - "subnet-056b1e9d7a7c099b3",
          - "subnet-097a520d3b27063c1",
          - "subnet-0a3a5e459c03ba765",
        ] -> null
      - tags                             = {} -> null
      - tags_all                         = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - vpc_id                           = "vpc-09dce0b23af575478" -> null
      - zone_id                          = "Z3F0SRJ5LGBH90" -> null

      - access_logs {
          - enabled = false -> null
        }

      - subnet_mapping {
          - subnet_id = "subnet-056b1e9d7a7c099b3" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-097a520d3b27063c1" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-0a3a5e459c03ba765" -> null
        }
    }

  # module.ecs.aws_appautoscaling_policy.ecs_target_cpu will be created
  + resource "aws_appautoscaling_policy" "ecs_target_cpu" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "application-scaling-policy-cpu"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/staging_keyserver_cluster/staging_keyserver-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in = false
          + target_value     = 80

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.ecs.aws_appautoscaling_policy.ecs_target_memory will be created
  + resource "aws_appautoscaling_policy" "ecs_target_memory" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "application-scaling-policy-memory"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/staging_keyserver_cluster/staging_keyserver-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in = false
          + target_value     = 80

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # module.ecs.aws_appautoscaling_target.ecs_target will be created
  + resource "aws_appautoscaling_target" "ecs_target" {
      + id                 = (known after apply)
      + max_capacity       = 8
      + min_capacity       = 2
      + resource_id        = "service/staging_keyserver_cluster/staging_keyserver-service"
      + role_arn           = "arn:aws:iam::898587786287:role/staging_keyserver-ecs-scale-application"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
    }

  # module.ecs.aws_ecs_service.app_service is tainted, so must be replaced
-/+ resource "aws_ecs_service" "app_service" {
      - health_check_grace_period_seconds  = 0 -> null
      ~ iam_role                           = "aws-service-role" -> (known after apply)
      ~ id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging_keyserver_cluster/staging_keyserver-service" -> (known after apply)
        name                               = "staging_keyserver-service"
      ~ platform_version                   = "LATEST" -> (known after apply)
      ~ propagate_tags                     = "NONE" -> "TASK_DEFINITION"
      - tags                               = {} -> null
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_keyserver:38" -> "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_keyserver"
        # (10 unchanged attributes hidden)

      - deployment_circuit_breaker {
          - enable   = false -> null
          - rollback = false -> null
        }

      - deployment_controller {
          - type = "ECS" -> null
        }

      ~ network_configuration {
          ~ security_groups  = [
              - "sg-01bc501da8fb9bf13",
              - "sg-04695b9070ff7e5e2",
            ] -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_lb.load_balancer will be created
  + resource "aws_lb" "load_balancer" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = (known after apply)
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = (known after apply)
      + security_groups            = (known after apply)
      + subnets                    = [
          + "subnet-056b1e9d7a7c099b3",
          + "subnet-097a520d3b27063c1",
          + "subnet-0a3a5e459c03ba765",
        ]
      + tags_all                   = {
          + "Application"      = "keyserver"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "keyserver"
          + "ProvisionedBy"    = "Terraform"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)
    }

  # module.ecs.aws_lb_listener.listener will be destroyed
  # (because aws_lb_listener.listener is not in configuration)
  - resource "aws_lb_listener" "listener" {
      - arn               = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/app/staging-keyserver-lb-104/aba40b31b1bdeda5/6943c9a90a6be012" -> null
      - certificate_arn   = "arn:aws:acm:eu-central-1:898587786287:certificate/4a2b7414-8a24-4235-aa0f-b5db9efab83c" -> null
      - id                = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/app/staging-keyserver-lb-104/aba40b31b1bdeda5/6943c9a90a6be012" -> null
      - load_balancer_arn = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/app/staging-keyserver-lb-104/aba40b31b1bdeda5" -> null
      - port              = 443 -> null
      - protocol          = "HTTPS" -> null
      - ssl_policy        = "ELBSecurityPolicy-2016-08" -> null
      - tags              = {} -> null
      - tags_all          = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null

      - default_action {
          - order            = 1 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-keyserver-b26/f8fbba44156675be" -> null
          - type             = "forward" -> null
        }
    }

  # module.ecs.aws_lb_listener.listener-http must be replaced
+/- resource "aws_lb_listener" "listener-http" {
      ~ arn               = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/app/staging-keyserver-lb-104/aba40b31b1bdeda5/e13cb5d5c48e3076" -> (known after apply)
      ~ id                = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/app/staging-keyserver-lb-104/aba40b31b1bdeda5/e13cb5d5c48e3076" -> (known after apply)
      ~ load_balancer_arn = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/app/staging-keyserver-lb-104/aba40b31b1bdeda5" # forces replacement -> (known after apply) # forces replacement
      + ssl_policy        = (known after apply)
      - tags              = {} -> null
        # (3 unchanged attributes hidden)

      ~ default_action {
          ~ order = 1 -> (known after apply)
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.ecs.aws_lb_listener.listener-https will be created
  + resource "aws_lb_listener" "listener-https" {
      + arn               = (known after apply)
      + certificate_arn   = "arn:aws:acm:eu-central-1:898587786287:certificate/4a2b7414-8a24-4235-aa0f-b5db9efab83c"
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-TLS13-1-2-2021-06"
      + tags_all          = {
          + "Application"      = "keyserver"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "keyserver"
          + "ProvisionedBy"    = "Terraform"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-keyserver-b26/f8fbba44156675be"
          + type             = "forward"
        }
    }

  # module.ecs.aws_lb_target_group.target_group will be updated in-place
  ~ resource "aws_lb_target_group" "target_group" {
      ~ deregistration_delay               = "30" -> "300"
        id                                 = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-keyserver-b26/f8fbba44156675be"
        name                               = "staging-keyserver-b26"
      ~ slow_start                         = 0 -> 30
        tags                               = {}
        # (12 unchanged attributes hidden)

      ~ health_check {
          ~ port                = "traffic-port" -> "8080"
          ~ timeout             = 5 -> 10
            # (7 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_lb_target_group.target_group (deposed object 46e9632d) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_lb_target_group" "target_group" {
      - arn                                = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-keyserver-7ab/a634a90b6f38bbd4" -> null
      - arn_suffix                         = "targetgroup/staging-keyserver-7ab/a634a90b6f38bbd4" -> null
      - connection_termination             = false -> null
      - deregistration_delay               = "30" -> null
      - id                                 = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-keyserver-7ab/a634a90b6f38bbd4" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - name                               = "staging-keyserver-7ab" -> null
      - port                               = 8080 -> null
      - preserve_client_ip                 = "false" -> null
      - protocol                           = "TCP" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 0 -> null
      - tags                               = {} -> null
      - tags_all                           = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - target_type                        = "ip" -> null
      - vpc_id                             = "vpc-09dce0b23af575478" -> null

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 2 -> null
          - interval            = 10 -> null
          - matcher             = "200-399" -> null
          - path                = "/health" -> null
          - port                = "traffic-port" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 6 -> null
          - unhealthy_threshold = 2 -> null
        }

      - stickiness {
          - cookie_duration = 0 -> null
          - enabled         = false -> null
          - type            = "source_ip" -> null
        }
    }

  # module.ecs.aws_route53_record.dns_load_balancer will be updated in-place
  ~ resource "aws_route53_record" "dns_load_balancer" {
        id      = "Z098781520DYMYC4P6VDC_staging.keys.walletconnect.com_A"
        name    = "staging.keys.walletconnect.com"
        # (5 unchanged attributes hidden)

      - alias {
          - evaluate_target_health = true -> null
          - name                   = "staging-keyserver-lb-104-196096211.eu-central-1.elb.amazonaws.com" -> null
          - zone_id                = "Z215JYRZR1TBD5" -> null
        }
      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.ecs.aws_security_group.app_ingress will be created
  + resource "aws_security_group" "app_ingress" {
      + arn                    = (known after apply)
      + description            = "Allow app port ingress"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.192.0.0/16",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Application"      = "keyserver"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "keyserver"
          + "ProvisionedBy"    = "Terraform"
        }
      + vpc_id                 = "vpc-09dce0b23af575478"
    }

  # module.ecs.aws_security_group.lb_ingress will be created
  + resource "aws_security_group" "lb_ingress" {
      + arn                    = (known after apply)
      + description            = "Allow app port ingress from vpc"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.192.0.0/16",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Application"      = "keyserver"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "keyserver"
          + "ProvisionedBy"    = "Terraform"
        }
      + vpc_id                 = "vpc-09dce0b23af575478"
    }

  # module.ecs.aws_security_group.tls_ingess will be destroyed
  # (because aws_security_group.tls_ingess is not in configuration)
  - resource "aws_security_group" "tls_ingess" {
      - arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-04695b9070ff7e5e2" -> null
      - description            = "Allow tls ingress from everywhere" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-04695b9070ff7e5e2" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
        ] -> null
      - name                   = "staging_keyserver-tls-ingress" -> null
      - owner_id               = "898587786287" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-09dce0b23af575478" -> null
    }

  # module.ecs.aws_security_group.vpc_app_ingress will be destroyed
  # (because aws_security_group.vpc_app_ingress is not in configuration)
  - resource "aws_security_group" "vpc_app_ingress" {
      - arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-01bc501da8fb9bf13" -> null
      - description            = "Allow app port ingress from vpc" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-01bc501da8fb9bf13" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.192.0.0/16",
                ]
              - description      = ""
              - from_port        = 8080
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 8080
            },
        ] -> null
      - name                   = "staging_keyserver-vpc-ingress-to-app" -> null
      - owner_id               = "898587786287" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-09dce0b23af575478" -> null
    }

  # module.o11y.data.jsonnet_file.dashboard will be read during apply
  # (config refers to values not yet known)
 <= data "jsonnet_file" "dashboard" {
      + ext_str  = {
          + "cloudwatch_uid"   = "LFwjdnQ4z"
          + "dashboard_title"  = "staging - keyserver"
          + "dashboard_uid"    = "staging-keyserver"
          + "docdb_cluster_id" = "staging-keyserver-keystore-docdb-primary-cluster"
          + "ecs_service_name" = "staging_keyserver-service"
          + "environment"      = "staging"
          + "load_balancer"    = (known after apply)
          + "notifications"    = jsonencode([])
          + "prometheus_uid"   = "WEwjdnw4k"
          + "target_group"     = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-keyserver-b26/f8fbba44156675be"
        }
      + id       = (known after apply)
      + rendered = (known after apply)
      + source   = "monitoring/dashboard.jsonnet"
    }

  # module.o11y.grafana_dashboard.main will be updated in-place
  ~ resource "grafana_dashboard" "main" {
      ~ config_json  = jsonencode(
            {
              - __inputs      = []
              - __requires    = []
              - annotations   = {
                  - list = [
                      - {
                          - builtIn    = 1
                          - datasource = "-- Grafana --"
                          - enable     = true
                          - hide       = true
                          - iconColor  = "rgba(0, 211, 255, 1)"
                          - name       = "Annotations & Alerts"
                          - showIn     = 0
                          - target     = {
                              - limit    = 100
                              - matchAny = false
                              - tags     = []
                              - type     = "dashboard"
                            }
                          - type       = "dashboard"
                        },
                    ]
                }
              - editable      = true
              - gnetId        = null
              - graphTooltip  = 1
              - hideControls  = false
              - links         = []
              - liveNow       = false
              - panels        = [
                  - {
                      - alert         = {
                          - alertRuleTags       = {}
                          - conditions          = [
                              - {
                                  - evaluator = {
                                      - params = [
                                          - 50,
                                        ]
                                      - type   = "gt"
                                    }
                                  - operator  = {
                                      - type = "or"
                                    }
                                  - query     = {
                                      - params = [
                                          - "CPU_Avg",
                                          - "25m",
                                          - "now",
                                        ]
                                    }
                                  - reducer   = {
                                      - params = []
                                      - type   = "max"
                                    }
                                  - type      = "query"
                                },
                              - {
                                  - evaluator = {
                                      - params = [
                                          - 50,
                                        ]
                                      - type   = "gt"
                                    }
                                  - operator  = {
                                      - type = "or"
                                    }
                                  - query     = {
                                      - params = [
                                          - "Mem_Avg",
                                          - "25m",
                                          - "now",
                                        ]
                                    }
                                  - reducer   = {
                                      - params = []
                                      - type   = "max"
                                    }
                                  - type      = "query"
                                },
                            ]
                          - executionErrorState = "alerting"
                          - for                 = "25m"
                          - frequency           = "1m"
                          - handler             = 1
                          - message             = "staging Keyserver App CPU/Memory"
                          - name                = "staging Keyserver App CPU/Memory alert"
                          - noDataState         = "alerting"
                          - notifications       = []
                        }
                      - datasource    = {
                          - type = "cloudwatch"
                          - uid  = "LFwjdnQ4z"
                        }
                      - description   = null
                      - fieldConfig   = {
                          - defaults  = {
                              - color      = {
                                  - mode = "palette-classic"
                                }
                              - custom     = {
                                  - axisPlacement     = "auto"
                                  - axisSoftMax       = 30
                                  - axisSoftMin       = 0
                                  - barAlignment      = 0
                                  - drawStyle         = "line"
                                  - fillOpacity       = 0
                                  - gradientMode      = "none"
                                  - lineInterpolation = "linear"
                                  - lineWidth         = 1
                                  - pointSize         = 5
                                  - scaleDistribution = {
                                      - type = "linear"
                                    }
                                  - showPoints        = "auto"
                                  - spanNulls         = false
                                  - stacking          = {
                                      - group = "A"
                                      - mode  = "none"
                                    }
                                  - thresholdsStyle   = {
                                      - mode = "area"
                                    }
                                }
                              - mappings   = []
                              - thresholds = {
                                  - mode  = "absolute"
                                  - steps = [
                                      - {
                                          - color = "green"
                                          - value = null
                                        },
                                      - {
                                          - color = "red"
                                          - value = 50
                                        },
                                    ]
                                }
                              - unit       = "percent"
                            }
                          - overrides = [
                              - {
                                  - matcher    = {
                                      - id      = "byFrameRefID"
                                      - options = "CPU_Max"
                                    }
                                  - properties = [
                                      - {
                                          - id    = "color"
                                          - value = {
                                              - fixedColor = "dark-blue"
                                              - mode       = "fixed"
                                            }
                                        },
                                    ]
                                },
                              - {
                                  - matcher    = {
                                      - id      = "byFrameRefID"
                                      - options = "CPU_Avg"
                                    }
                                  - properties = [
                                      - {
                                          - id    = "color"
                                          - value = {
                                              - fixedColor = "blue"
                                              - mode       = "fixed"
                                            }
                                        },
                                    ]
                                },
                              - {
                                  - matcher    = {
                                      - id      = "byFrameRefID"
                                      - options = "Mem_Max"
                                    }
                                  - properties = [
                                      - {
                                          - id    = "color"
                                          - value = {
                                              - fixedColor = "dark-purple"
                                              - mode       = "fixed"
                                            }
                                        },
                                    ]
                                },
                              - {
                                  - matcher    = {
                                      - id      = "byFrameRefID"
                                      - options = "Mem_Avg"
                                    }
                                  - properties = [
                                      - {
                                          - id    = "color"
                                          - value = {
                                              - fixedColor = "purple"
                                              - mode       = "fixed"
                                            }
                                        },
                                    ]
                                },
                            ]
                        }
                      - gridPos       = {
                          - h = 8
                          - w = 12
                          - x = 0
                          - y = 0
                        }
                      - links         = []
                      - options       = {
                          - legend  = {
                              - calcs       = []
                              - displayMode = "list"
                              - placement   = "bottom"
                            }
                          - tooltip = {
                              - mode = "multi"
                              - sort = "none"
                            }
                        }
                      - pluginVersion = "8.4.7"
                      - targets       = [
                          - {
                              - alias            = "CPU (Max)"
                              - datasource       = {
                                  - type = "cloudwatch"
                                  - uid  = "LFwjdnQ4z"
                                }
                              - dimensions       = {
                                  - ServiceName = "staging_keyserver-service"
                                }
                              - expression       = ""
                              - matchExact       = false
                              - metricEditorMode = 0
                              - metricName       = "CPUUtilization"
                              - metricQueryType  = 0
                              - namespace        = "AWS/ECS"
                              - period           = "auto"
                              - queryMode        = "Metrics"
                              - refId            = "CPU_Max"
                              - region           = "default"
                              - statistic        = "Maximum"
                            },
                          - {
                              - alias            = "CPU (Avg)"
                              - datasource       = {
                                  - type = "cloudwatch"
                                  - uid  = "LFwjdnQ4z"
                                }
                              - dimensions       = {
                                  - ServiceName = "staging_keyserver-service"
                                }
                              - expression       = ""
                              - matchExact       = false
                              - metricEditorMode = 0
                              - metricName       = "CPUUtilization"
                              - metricQueryType  = 0
                              - namespace        = "AWS/ECS"
                              - period           = "auto"
                              - queryMode        = "Metrics"
                              - refId            = "CPU_Avg"
                              - region           = "default"
                              - statistic        = "Average"
                            },
                          - {
                              - alias            = "Memory (Max)"
                              - datasource       = {
                                  - type = "cloudwatch"
                                  - uid  = "LFwjdnQ4z"
                                }
                              - dimensions       = {
                                  - ServiceName = "staging_keyserver-service"
                                }
                              - expression       = ""
                              - matchExact       = false
                              - metricEditorMode = 0
                              - metricName       = "MemoryUtilization"
                              - metricQueryType  = 0
                              - namespace        = "AWS/ECS"
                              - period           = "auto"
                              - queryMode        = "Metrics"
                              - refId            = "Mem_Max"
                              - region           = "default"
                              - statistic        = "Maximum"
                            },
                          - {
                              - alias            = "Memory (Avg)"
                              - datasource       = {
                                  - type = "cloudwatch"
                                  - uid  = "LFwjdnQ4z"
                                }
                              - dimensions       = {
                                  - ServiceName = "staging_keyserver-service"
                                }
                              - expression       = ""
                              - matchExact       = false
                              - metricEditorMode = 0
                              - metricName       = "MemoryUtilization"
                              - metricQueryType  = 0
                              - namespace        = "AWS/ECS"
                              - period           = "auto"
                              - queryMode        = "Metrics"
                              - refId            = "Mem_Avg"
                              - region           = "default"
                              - statistic        = "Average"
                            },
                        ]
                      - title         = "App CPU/Memory"
                      - type          = "timeseries"
                    },
                  - {
                      - datasource    = {
                          - type = "cloudwatch"
                          - uid  = "LFwjdnQ4z"
                        }
                      - description   = null
                      - fieldConfig   = {
                          - defaults  = {
                              - color      = {
                                  - mode = "palette-classic"
                                }
                              - custom     = {
                                  - axisPlacement     = "auto"
                                  - axisSoftMax       = 5
                                  - axisSoftMin       = 0
                                  - barAlignment      = 0
                                  - drawStyle         = "line"
                                  - fillOpacity       = 0
                                  - gradientMode      = "none"
                                  - lineInterpolation = "linear"
                                  - lineWidth         = 1
                                  - pointSize         = 5
                                  - scaleDistribution = {
                                      - type = "linear"
                                    }
                                  - showPoints        = "auto"
                                  - spanNulls         = false
                                  - stacking          = {
                                      - group = "A"
                                      - mode  = "none"
                                    }
                                  - thresholdsStyle   = {
                                      - mode = "off"
                                    }
                                }
                              - mappings   = []
                              - thresholds = {
                                  - mode  = "absolute"
                                  - steps = [
                                      - {
                                          - color = "green"
                                          - value = null
                                        },
                                    ]
                                }
                            }
                          - overrides = []
                        }
                      - gridPos       = {
                          - h = 8
                          - w = 12
                          - x = 12
                          - y = 0
                        }
                      - links         = []
                      - options       = {
                          - legend  = {
                              - calcs       = []
                              - displayMode = "list"
                              - placement   = "bottom"
                            }
                          - tooltip = {
                              - mode = "multi"
                              - sort = "none"
                            }
                        }
                      - pluginVersion = "8.4.7"
                      - targets       = [
                          - {
                              - alias            = "Hosts Count"
                              - datasource       = {
                                  - type = "cloudwatch"
                                  - uid  = "LFwjdnQ4z"
                                }
                              - dimensions       = {}
                              - expression       = ""
                              - matchExact       = false
                              - metricEditorMode = 0
                              - metricName       = "HealthyHostCount"
                              - metricQueryType  = 1
                              - namespace        = "AWS/NetworkELB"
                              - period           = "auto"
                              - queryMode        = "Metrics"
                              - refId            = "A"
                              - region           = "default"
                              - sql              = {
                                  - from   = {
                                      - property = {
                                          - name = "AWS/NetworkELB"
                                          - type = "string"
                                        }
                                      - type     = "property"
                                    }
                                  - select = {
                                      - name       = "MAX"
                                      - parameters = [
                                          - {
                                              - name = "HealthyHostCount"
                                              - type = "functionParameter"
                                            },
                                        ]
                                      - type       = "function"
                                    }
                                  - where  = {
                                      - expressions = [
                                          - {
                                              - operator = {
                                                  - name  = "="
                                                  - value = "net/staging-keyserver-lb-582/61a6a8c83222a1e6"
                                                }
                                              - property = {
                                                  - name = "LoadBalancer"
                                                  - type = "string"
                                                }
                                              - type     = "operator"
                                            },
                                        ]
                                      - type        = "and"
                                    }
                                }
                              - sqlExpression    = "SELECT MAX(HealthyHostCount) FROM \"AWS/NetworkELB\" WHERE LoadBalancer = 'net/staging-keyserver-lb-582/61a6a8c83222a1e6'"
                              - statistic        = "Average"
                            },
                        ]
                      - title         = "Healthy Hosts"
                      - type          = "timeseries"
                    },
                  - {
                      - datasource    = {
                          - type = "cloudwatch"
                          - uid  = "LFwjdnQ4z"
                        }
                      - description   = null
                      - fieldConfig   = {
                          - defaults  = {
                              - color      = {
                                  - mode = "palette-classic"
                                }
                              - custom     = {
                                  - axisPlacement     = "auto"
                                  - axisSoftMax       = 100
                                  - axisSoftMin       = 0
                                  - barAlignment      = 0
                                  - drawStyle         = "line"
                                  - fillOpacity       = 0
                                  - gradientMode      = "none"
                                  - lineInterpolation = "linear"
                                  - lineWidth         = 1
                                  - pointSize         = 5
                                  - scaleDistribution = {
                                      - type = "linear"
                                    }
                                  - showPoints        = "auto"
                                  - spanNulls         = false
                                  - stacking          = {
                                      - group = "A"
                                      - mode  = "none"
                                    }
                                  - thresholdsStyle   = {
                                      - mode = "off"
                                    }
                                }
                              - mappings   = []
                              - thresholds = {
                                  - mode  = "absolute"
                                  - steps = [
                                      - {
                                          - color = "green"
                                          - value = null
                                        },
                                    ]
                                }
                            }
                          - overrides = []
                        }
                      - gridPos       = {
                          - h = 8
                          - w = 12
                          - x = 0
                          - y = 8
                        }
                      - links         = []
                      - options       = {
                          - legend  = {
                              - calcs       = []
                              - displayMode = "list"
                              - placement   = "bottom"
                            }
                          - tooltip = {
                              - mode = "multi"
                              - sort = "none"
                            }
                        }
                      - pluginVersion = "8.4.7"
                      - targets       = [
                          - {
                              - alias            = "LB-0"
                              - datasource       = {
                                  - type = "cloudwatch"
                                  - uid  = "LFwjdnQ4z"
                                }
                              - dimensions       = {
                                  - LoadBalancer = "net/staging-keyserver-lb-582/61a6a8c83222a1e6"
                                }
                              - expression       = ""
                              - matchExact       = true
                              - metricEditorMode = 0
                              - metricName       = "ActiveFlowCount_TLS"
                              - metricQueryType  = 0
                              - namespace        = "AWS/NetworkELB"
                              - period           = "auto"
                              - queryMode        = "Metrics"
                              - refId            = "A"
                              - region           = "default"
                              - statistic        = "Maximum"
                            },
                        ]
                      - title         = "Active NLB Flows"
                      - type          = "timeseries"
                    },
                  - {
                      - datasource    = {
                          - type = "cloudwatch"
                          - uid  = "LFwjdnQ4z"
                        }
                      - description   = "When the NLB has connection failures to the targets then these jump. We for instance had this when we had a too low file descriptor limit."
                      - fieldConfig   = {
                          - defaults  = {
                              - color      = {
                                  - mode = "palette-classic"
                                }
                              - custom     = {
                                  - axisPlacement     = "auto"
                                  - axisSoftMax       = 250
                                  - axisSoftMin       = 0
                                  - barAlignment      = 0
                                  - drawStyle         = "line"
                                  - fillOpacity       = 0
                                  - gradientMode      = "none"
                                  - lineInterpolation = "linear"
                                  - lineWidth         = 1
                                  - pointSize         = 5
                                  - scaleDistribution = {
                                      - type = "linear"
                                    }
                                  - showPoints        = "auto"
                                  - spanNulls         = false
                                  - stacking          = {
                                      - group = "A"
                                      - mode  = "none"
                                    }
                                  - thresholdsStyle   = {
                                      - mode = "off"
                                    }
                                }
                              - mappings   = []
                              - thresholds = {
                                  - mode  = "absolute"
                                  - steps = [
                                      - {
                                          - color = "green"
                                          - value = null
                                        },
                                      - {
                                          - color = "red"
                                          - value = 80
                                        },
                                    ]
                                }
                            }
                          - overrides = []
                        }
                      - gridPos       = {
                          - h = 8
                          - w = 12
                          - x = 12
                          - y = 8
                        }
                      - links         = []
                      - options       = {
                          - legend  = {
                              - calcs       = []
                              - displayMode = "list"
                              - placement   = "bottom"
                            }
                          - tooltip = {
                              - mode = "multi"
                              - sort = "none"
                            }
                        }
                      - pluginVersion = "8.4.7"
                      - targets       = [
                          - {
                              - alias            = "LB-0"
                              - datasource       = {
                                  - type = "cloudwatch"
                                  - uid  = "LFwjdnQ4z"
                                }
                              - dimensions       = {
                                  - LoadBalancer = "net/staging-keyserver-lb-582/61a6a8c83222a1e6"
                                }
                              - expression       = ""
                              - matchExact       = true
                              - metricEditorMode = 0
                              - metricName       = "TCP_Target_Reset_Count"
                              - metricQueryType  = 0
                              - namespace        = "AWS/NetworkELB"
                              - period           = "auto"
                              - queryMode        = "Metrics"
                              - refId            = "A"
                              - region           = "default"
                              - statistic        = "Sum"
                            },
                        ]
                      - title         = "NLB Target Resets"
                      - type          = "timeseries"
                    },
                  - {
                      - content     = "# DocumentDB"
                      - datasource  = null
                      - gridPos     = {
                          - h = 4
                          - w = 24
                          - x = 0
                          - y = 16
                        }
                      - mode        = "markdown"
                      - title       = ""
                      - transparent = true
                      - type        = "text"
                    },
                  - {
                      - alert         = {
                          - alertRuleTags       = {}
                          - conditions          = [
                              - {
                                  - evaluator = {
                                      - params = [
                                          - 50,
                                        ]
                                      - type   = "gt"
                                    }
                                  - operator  = {
                                      - type = "or"
                                    }
                                  - query     = {
                                      - params = [
                                          - "CPU_Max",
                                          - "5m",
                                          - "now",
                                        ]
                                    }
                                  - reducer   = {
                                      - params = []
                                      - type   = "avg"
                                    }
                                  - type      = "query"
                                },
                            ]
                          - executionErrorState = "alerting"
                          - for                 = "5m"
                          - frequency           = "1m"
                          - handler             = 1
                          - message             = "staging Keyserver DocumentDB CPU alert"
                          - name                = "staging Keyserver DocumentDB CPU alert"
                          - noDataState         = "alerting"
                          - notifications       = []
                        }
                      - datasource    = {
                          - type = "cloudwatch"
                          - uid  = "LFwjdnQ4z"
                        }
                      - description   = null
                      - fieldConfig   = {
                          - defaults  = {
                              - color      = {
                                  - mode = "palette-classic"
                                }
                              - custom     = {
                                  - axisPlacement     = "auto"
                                  - axisSoftMax       = 30
                                  - axisSoftMin       = 0
                                  - barAlignment      = 0
                                  - drawStyle         = "line"
                                  - fillOpacity       = 0
                                  - gradientMode      = "none"
                                  - lineInterpolation = "linear"
                                  - lineWidth         = 1
                                  - pointSize         = 5
                                  - scaleDistribution = {
                                      - type = "linear"
                                    }
                                  - showPoints        = "auto"
                                  - spanNulls         = false
                                  - stacking          = {
                                      - group = "A"
                                      - mode  = "none"
                                    }
                                  - thresholdsStyle   = {
                                      - mode = "area"
                                    }
                                }
                              - mappings   = []
                              - thresholds = {
                                  - mode  = "absolute"
                                  - steps = [
                                      - {
                                          - color = "green"
                                          - value = null
                                        },
                                      - {
                                          - color = "red"
                                          - value = 50
                                        },
                                    ]
                                }
                              - unit       = "percent"
                            }
                          - overrides = [
                              - {
                                  - matcher    = {
                                      - id      = "byFrameRefID"
                                      - options = "CPU_Max"
                                    }
                                  - properties = [
                                      - {
                                          - id    = "color"
                                          - value = {
                                              - fixedColor = "dark-blue"
                                              - mode       = "fixed"
                                            }
                                        },
                                    ]
                                },
                              - {
                                  - matcher    = {
                                      - id      = "byFrameRefID"
                                      - options = "CPU_Avg"
                                    }
                                  - properties = [
                                      - {
                                          - id    = "color"
                                          - value = {
                                              - fixedColor = "blue"
                                              - mode       = "fixed"
                                            }
                                        },
                                    ]
                                },
                              - {
                                  - matcher    = {
                                      - id      = "byFrameRefID"
                                      - options = "Mem_Max"
                                    }
                                  - properties = [
                                      - {
                                          - id    = "color"
                                          - value = {
                                              - fixedColor = "dark-purple"
                                              - mode       = "fixed"
                                            }
                                        },
                                    ]
                                },
                              - {
                                  - matcher    = {
                                      - id      = "byFrameRefID"
                                      - options = "Mem_Avg"
                                    }
                                  - properties = [
                                      - {
                                          - id 
...

```

</details>

*Action: `pull_request`*